<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"028e3f3d1398e0c384f7c065b8437bcae8c0653477a8b5a5ea9f356a6d41d0eb","plan_job_ref":"Job Terraform checks on pull request #46 at https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/13882784026","plan_out_hash":"4e59bfb01dc58c6b1af72fb5c7a9ba05fda65c51a93c2471cc338911ce344004","plan_hash":"58144fe0d7d8121b1ddacce3d3bb5f8c113a42774fa572bd95c7c9aea43b95e1","plan_text_format":"diff","version":"1.47.0"} -->
Terraform plan in __./__
<details>
<summary>Plan: 9 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # module.repositories["sudoblark.github.io"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.github.io"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.github.io"].github_branch_protection.main will be created
+   resource "github_branch_protection" "main" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       blocks_creations                = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "main"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = true
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = true
+           require_code_owner_reviews      = true
+           required_approving_review_count = 1
        }

+       required_status_checks {
+           strict = true
        }
    }

  # module.repositories["sudoblark.github.io"].github_repository.repository will be created
+   resource "github_repository" "repository" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = false
+       allow_squash_merge          = true
+       archived                    = false
+       auto_init                   = true
+       branches                    = (known after apply)
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "GitHub Pages repository for sudoblark.com website - repo managed by sudoblark.terraform.github"
+       etag                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_downloads               = true
+       has_issues                  = true
+       has_projects                = true
+       has_wiki                    = true
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "sudoblark.github.io"
+       node_id                     = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "github",
+           "website",
        ]
+       visibility                  = "private"
    }

  # module.repositories["sudoblark.github.io"].github_repository_file.gitignore will be created
+   resource "github_repository_file" "gitignore" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = ".gitignore - managed by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            # Created by .ignore support plugin (hsz.mobi)
            ### Python template
            # Byte-compiled / optimized / DLL files
            __pycache__/
            *.py[cod]
            *$py.class
            
            # C extensions
            *.so
            
            # Distribution / packaging
            .Python
            env/
            build/
            develop-eggs/
            dist/
            downloads/
            eggs/
            .eggs/
            lib/
            lib64/
            parts/
            sdist/
            var/
            *.egg-info/
            .installed.cfg
            *.egg
            
            # PyInstaller
            #  Usually these files are written by a python script from a template
            #  before PyInstaller builds the exe, so as to inject date/other infos into it.
            *.manifest
            *.spec
            
            # Installer logs
            pip-log.txt
            pip-delete-this-directory.txt
            
            # Unit test / coverage reports
            htmlcov/
            .tox/
            .coverage
            .coverage.*
            .cache
            nosetests.xml
            coverage.xml
            *,cover
            .hypothesis/
            
            # Translations
            *.mo
            *.pot
            
            # Django stuff:
            *.log
            local_settings.py
            
            # Flask stuff:
            instance/
            .webassets-cache
            
            # Scrapy stuff:
            .scrapy
            
            # Sphinx documentation
            docs/_build/
            
            # PyBuilder
            target/
            
            # IPython Notebook
            .ipynb_checkpoints
            
            # pyenv
            .python-version
            
            # celery beat schedule file
            celerybeat-schedule
            
            # dotenv
            .env
            
            # virtualenv
            venv/
            ENV/
            
            # Spyder project settings
            .spyderproject
            
            # Rope project settings
            .ropeproject
            ### VirtualEnv template
            # Virtualenv
            # http://iamzed.com/2009/05/07/a-primer-on-virtualenv/
            [Bb]in
            [Ii]nclude
            [Ll]ib
            [Ll]ib64
            [Ll]ocal
            [Ss]cripts
            pyvenv.cfg
            .venv
            pip-selfcheck.json
            
            ### JetBrains template
            # Covers JetBrains IDEs: IntelliJ, RubyMine, PhpStorm, AppCode, PyCharm, CLion, Android Studio, WebStorm and Rider
            # Reference: https://intellij-support.jetbrains.com/hc/en-us/articles/206544839
            
            # User-specific stuff
            .idea/**/workspace.xml
            .idea/**/tasks.xml
            .idea/**/usage.statistics.xml
            .idea/**/dictionaries
            .idea/**/shelf
            
            # AWS User-specific
            .idea/**/aws.xml
            
            # Generated files
            .idea/**/contentModel.xml
            
            # Sensitive or high-churn files
            .idea/**/dataSources/
            .idea/**/dataSources.ids
            .idea/**/dataSources.local.xml
            .idea/**/sqlDataSources.xml
            .idea/**/dynamic.xml
            .idea/**/uiDesigner.xml
            .idea/**/dbnavigator.xml
            
            # Gradle
            .idea/**/gradle.xml
            .idea/**/libraries
            
            # Gradle and Maven with auto-import
            # When using Gradle or Maven with auto-import, you should exclude module files,
            # since they will be recreated, and may cause churn.  Uncomment if using
            # auto-import.
            # .idea/artifacts
            # .idea/compiler.xml
            # .idea/jarRepositories.xml
            # .idea/modules.xml
            # .idea/*.iml
            # .idea/modules
            # *.iml
            # *.ipr
            
            # CMake
            cmake-build-*/
            
            # Mongo Explorer plugin
            .idea/**/mongoSettings.xml
            
            # File-based project format
            *.iws
            
            # IntelliJ
            out/
            
            # mpeltonen/sbt-idea plugin
            .idea_modules/
            
            # JIRA plugin
            atlassian-ide-plugin.xml
            
            # Cursive Clojure plugin
            .idea/replstate.xml
            
            # SonarLint plugin
            .idea/sonarlint/
            
            # Crashlytics plugin (for Android Studio and IntelliJ)
            com_crashlytics_export_strings.xml
            crashlytics.properties
            crashlytics-build.properties
            fabric.properties
            
            # Editor-based Rest Client
            .idea/httpRequests
            
            # Android studio 3.1+ serialized cache file
            .idea/caches/build_file_checksums.ser
            
            # idea folder, uncomment if you don't need it
            .idea
            
            ### Terraform template
            # Local .terraform directories
            **/.terraform/*
            
            # .tfstate files
            *.tfstate
            *.tfstate.*
            
            # Crash log files
            crash.log
            crash.*.log
            
            # Exclude all .tfvars files, which are likely to contain sensitive data, such as
            # password, private keys, and other secrets. These should not be part of version
            # control as they are data points which are potentially sensitive and subject
            # to change depending on the environment.
            *.tfvars
            *.tfvars.json
            
            # Ignore override files as they are usually used to override resources locally and so
            # are not checked in
            override.tf
            override.tf.json
            *_override.tf
            *_override.tf.json
            
            # Include override files you do wish to add to version control using negated pattern
            # !example_override.tf
            
            # Include tfplan files to ignore the plan output of command: terraform plan -out=tfplan
            # example: *tfplan*
            
            # Ignore CLI configuration files
            .terraformrc
            terraform.rc
            # Lock file automatically managed by Terraform
            **/.terraform.lock.hcl
            
            # PyTest
            **/.pytest_cache
            .vscode/settings.json
            
            # MacOS
            .DS_Store
            .ado/templates/query_status.json
            
            # Temp dev files
            dev_scratchpad/*
        EOT
+       file                = ".gitignore"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.github.io"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.github.io"].github_repository_file.license will be created
+   resource "github_repository_file" "license" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = "license.txt - managed by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            Copyright (C) Sudoblark Ltd, Inc - All Rights Reserved
            Unauthorized copying of this file, via any medium is strictly prohibited
            Proprietary and confidential
            Written by Benjamin Clark <bclark@sudoblark.com>, 2024
        EOT
+       file                = "LICENSE.txt"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.github.io"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.github.io"].github_repository_file.precommit will be created
+   resource "github_repository_file" "precommit" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = ".pre-commit-config.yaml - managed by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            
        EOT
+       file                = ".pre-commit-config.yaml"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.github.io"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.github.io"].github_repository_file.pull-request-template will be created
+   resource "github_repository_file" "pull-request-template" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = "pull_request_template.md - managed by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            # Description
            
            Please include a summary of the changes and the related issue. Please also include relevant motivation and context. List any dependencies that are required for this change.
            
            Fixes # (issue)
            
            ## Type of change
            
            Please delete options that are not relevant.
            
            - [ ] Bug fix (non-breaking change which fixes an issue)
            - [ ] New feature (non-breaking change which adds functionality)
            - [ ] Breaking change (fix or feature that would cause existing functionality to not work as expected)
            - [ ] This change requires a documentation update
            
            # How Has This Been Tested?
            
            Please describe the tests that you ran to verify your changes. Provide instructions so we can reproduce. Please also list any relevant details for your test configuration
            
            - [ ] Test A
            - [ ] Test B
            
            # Checklist:
            
            - [] My code follows the style guidelines of this project
            - [] I have made corresponding changes to the documentation
        EOT
+       file                = ".github/pull_request_template.md"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.github.io"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.github.io"].github_repository_file.readme will be created
+   resource "github_repository_file" "readme" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = "README.md - initial creation by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            # sudoblark.github.io
            GitHub Pages repository for sudoblark.com website - repo managed by sudoblark.terraform.github
        EOT
+       file                = "README.md"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.github.io"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.github.io"].github_repository_file.repository_codeowners_file will be created
+   resource "github_repository_file" "repository_codeowners_file" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = "CODEOWNERS - managed by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            # Default owners for all the things in the repo - managed by sudoblark.terraform.github
            * @benjaminlukeclark
        EOT
+       file                = ".github/CODEOWNERS"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.github.io"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.terraform.ci-cd-observability-monitoring"].github_branch_protection.main will be created
+   resource "github_branch_protection" "main" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       blocks_creations                = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "main"
+       repository_id                   = "************"
+       require_conversation_resolution = true
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = true
+           require_code_owner_reviews      = true
+           required_approving_review_count = 1
        }

+       required_status_checks {
+           strict = true
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform checks on pull request #46](https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/13882784026)